{
    "title": [
        {
            "language": "English",
            "content": "Software Engineer"
        },
        {
            "language": "English",
            "content": "XR Game Developer"
        },
        {
            "language": "English",
            "content": "XR Enthusiast"
        },
        {
            "language": "English",
            "content": "Unity Developer"
        },
        {
            "language": "English",
            "content": "Game Developer"
        },
        {
            "language": "English",
            "content": "Mobile Developer"
        },
        {
            "language": "English",
            "content": "Creative Technologist"
        },
        {
            "language": "English",
            "content": "Youtuber"
        },
        {
            "language": "Español",
            "content": "Desarrollador de Software"
        },
        {
            "language": "Español",
            "content": "Desarrollador de videojuegos XR"
        },
        {
            "language": "Español",
            "content": "Entusiasta de XR"
        },
        {
            "language": "Español",
            "content": "Desarrollador Unity"
        },
        {
            "language": "Español",
            "content": "Desarrollador de videojuegos"
        },
        {
            "language": "Español",
            "content": "Desarrollador móvil"
        },
        {
            "language": "Español",
            "content": "Tecnólogo creativo"
        },
        {
            "language": "Español",
            "content": "Youtuber"
        }
    ],
    "description": [
        {
            "language": "English",
            "content": "Software Developer with 7 years of experience in designing and delivering innovative mobile applications, interactive experiences, and games for AR, VR, and MR platforms, including Android, iOS, Meta Quest 2, and HoloLens. Proficient in Unity Engine (C#), Unreal Engine (C++, Blueprints), and Swift-based iOS development with ARKit, RealityKit, SwiftUI, and UIKit. Skilled in cross-platform development and integrating native libraries in Swift for iOS and Java for Android, with a growing interest in C and Swift interoperability. Currently pursuing a Master’s in Applied Computing at The University of Oklahoma to advance expertise in software engineering and native integrations. Fluent in Spanish and English (C1 IELTS 2022). Eager to contribute technical expertise and creative problem-solving to a dynamic team building innovative mobile and XR solutions and games."
        },
        {
            "language": "Español",
            "content": "Hola, soy David, un desarrollador de software con más de 7 años de experiencia en la creación de aplicaciones móviles innovadoras, experiencias interactivas y juegos para plataformas de AR, VR y MR, incluyendo Android, iOS, Meta Quest 2 y HoloLens. Soy competente en Unity Engine (C#), Unreal Engine (C++, Blueprints) y desarrollo de iOS basado en Swift con ARKit, RealityKit, SwiftUI y UIKit. Tengo habilidades en desarrollo multiplataforma e integración de bibliotecas nativas en Swift para iOS y Java para Android, con un creciente interés en la interoperabilidad entre C y Swift. Actualmente estoy cursando una Maestría en Computación Aplicada en la Universidad de Oklahoma para avanzar en mi experiencia en ingeniería de software e integraciones nativas. Hablo español e inglés con fluidez (C1 IELTS 2022). Estoy ansioso por contribuir con mi experiencia técnica y habilidades creativas para resolver problemas en un equipo dinámico que construye soluciones móviles y XR innovadoras y juegos."
        }
    ],
    "socials": [
        {
            "type": "LinkedIn",
            "src": "https://www.linkedin.com/in/david-acosta-laverde/"
        },
        {
            "type": "GitHub",
            "src": "https://github.com/batiacosta"
        },
        {
            "type": "YouTube",
            "src": "https://www.youtube.com/@octe-en"
        }
    ],
    "subtitles": [
        {
            "subtitle": [
                {
                    "language": "English",
                    "content": "Professional Work"
                },
                {
                    "language": "Español",
                    "content": "Trabajo Profesional"
                }
            ],
            "description": [
                {
                    "language": "English",
                    "content": "Explore my professional work and contributions to the XR industry, including AR, VR, and MR projects, game development, and creative technology."
                },
                {
                    "language": "Español",
                    "content": "Explora mi trabajo profesional y contribuciones a la industria XR, incluyendo proyectos de AR, VR y MR, desarrollo de videojuegos y tecnología creativa."
                }
            ]
        },
        {
            "subtitle": [
                {
                    "language": "English",
                    "content": "Independent Ventures"
                },
                {
                    "language": "Español",
                    "content": "Proyectos Independientes"
                }
            ],
            "description": [
                {
                    "language": "English",
                    "content": "Discover my latest projects, including AR, VR, and MR experiences, game development, and creative technology."
                },
                {
                    "language": "Español",
                    "content": "Descubre mis últimos proyectos, incluyendo experiencias de AR, VR y MR, desarrollo de videojuegos y tecnología creativa."
                }
            ]
        }
    ]
}
