[
    {
        "title": {
            "English": "CryptRaider",
            "Español": "CryptRaider"
        },
        "media": [
            {
                "type": "youtube",
                "src": "https://www.youtube.com/embed/2qlLHRB5nOE?si=6BrJ_uLcWVqsmHq8",
                "alt": "Project"
            },
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/CryptRaider/Entry.gif",
                "alt": "Entry"
            },
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/CryptRaider/Hall1.gif",
                "alt": "Hall"
            }
            ,
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/CryptRaider/ClosingTrap.gif",
                "alt": "Hall"
            }
            ,
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/CryptRaider/OpeningTrap.gif",
                "alt": "Hall"
            }
            ,
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/CryptRaider/OpeningLevel2.gif",
                "alt": "Hall"
            }
            ,
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/CryptRaider/FinalStatue.gif",
                "alt": "Hall"
            }
        ],
        "description": {
            "English": "CryptRaider is an immersive puzzle-solving adventure set within a mysterious crypt, where players must decipher intricate challenges to unlock the door and escape. Built using Unreal Engine 5, the game combines C++ and Blueprints to deliver a polished experience. It incorporates advanced features such as linetracing for precise interactions, physics-based mechanics, collision meshes for realistic environments, optimized Level of Detail (LODs), and more, reflecting a fusion of technical prowess and creative design. The project’s source code is publicly available on GitHub, alongside compiled release versions for both Mac and Windows, making it accessible for exploration and collaboration.",
            "Español": "CryptRaider es una aventura inmersiva de resolución de acertijos ambientada en una cripta misteriosa, donde los jugadores deben descifrar desafíos intrincados para desbloquear la puerta y escapar. Construido con Unreal Engine 5, el juego combina C++ y Blueprints para ofrecer una experiencia pulida. Incorpora funciones avanzadas como linetracing para interacciones precisas, mecánicas basadas en física, mallas de colisión para entornos realistas, Niveles de Detalle (LODs) optimizados y más, reflejando una fusión de destreza técnica y diseño creativo. El código fuente del proyecto está disponible públicamente en GitHub, junto con versiones compiladas para Mac y Windows, lo que lo hace accesible para la exploración y la colaboración."
        },
        "summary": {
            "English": "CryptRaider is a puzzle-solving adventure set in a crypt, built with Unreal Engine 5 using C++ and Blueprints. Players unlock the exit using linetracing, physics, collision meshes, and optimized LODs. The source code and compiled releases for Mac and Windows are available on GitHub",
            "Español": "CryptRaider es una aventura de resolución de acertijos ambientada en una cripta, construida con Unreal Engine 5 utilizando C++ y Blueprints. Los jugadores desbloquean la salida utilizando linetracing, física, mallas de colisión y LODs optimizados. El código fuente y las versiones compiladas para Mac y Windows están disponibles en GitHub."
        },
        "links":[
            {
                "type": "github",
                "src": "https://github.com/batiacosta/CryptRaider",
                "platform": "Repository"
            },
            {
                "type": "apple",
                "src": "https://github.com/batiacosta/CryptRaider/releases/tag/Alpha",
                "platform": "MacOS"
            },
            {
                "type": "windows",
                "src": "https://github.com/batiacosta/CryptRaider/releases/tag/Alpha",
                "platform": "Windows"
            }
        ],
        "tags": {
            "English": [ "Unreal Engine", "UE5", "C++", "Game Development", "Public Repository"],
            "Español": ["Unreal Engine", "UE5", "C++", "Desarrollo de Juegos", "Repositorio Público"]
        }
    },
    {
        "title": {
            "English": "Apples Catcher",
            "Español": "Apples Catcher"
        },
        "media": [
            {
                "type": "youtube",
                "src": "https://www.youtube.com/embed/Xf2Q_bzk7Qg?si=8aauP6Bjz2btnUhY",
                "alt": "Video"
            },
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/ApplesCatcher/applesCatcher.gif",
                "alt": "Freibuddy"
            },
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/ApplesCatcher/start.png",
                "alt": "Freibuddy"
            }
            ,
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/ApplesCatcher/win.png",
                "alt": "Freibuddy"
            }
        ],
        "description": {
            "English": "Apples catcher is a game developed in Phaser JS in a Vite setup. The project is meant to explore the capabilities of the Phaser JS framework and the Vite bundler. The game is a simple 2D game where the player controls a basket to catch falling apples. The game has a start screen, a game screen, and a win screen.",
            "Español": "Apples catcher es un juego desarrollado en Phaser JS en un entorno de Vite. El proyecto tiene como objetivo explorar las capacidades del framework Phaser JS y el empaquetador Vite. El juego es un juego 2D simple en el que el jugador controla una cesta para atrapar manzanas que caen. El juego tiene una pantalla de inicio, una pantalla de juego y una pantalla de victoria."
        },
        "summary": {
            "English": "Apples Catcher is a 2D game developed in Phaser JS using a Vite setup. Players control a basket to catch falling apples, with start and win screens included.",
            "Español": "Apples Catcher es un juego 2D desarrollado en Phaser JS utilizando un entorno de Vite. Los jugadores controlan una cesta para atrapar manzanas que caen, con pantallas de inicio y victoria incluidas."
        },
        "links":[
            {
                "type": "github",
                "src": "https://github.com/batiacosta/AppleCatcher",
                "platform": "Repository"
            },
            {
                "type": "web",
                "src": "https://octe.itch.io/apples-catcher",
                "platform": "Playable Demo"
            }
        ],
        "tags": {
            "English": ["Published", "AR", "Unity", "C#", "AR Foundation", "Contribution"],
            "Español": ["Publicado", "AR", "Unity", "C#", "AR Foundation", "Contribución"]
        }
    }
    ,
    {
        "title": {
            "English": "Flappy-Bird",
            "Español": "Flappy-Bird"
        },
        "media": [
            {
                "type": "youtube",
                "src": "https://www.youtube.com/embed/___RZsBrSzU?si=N4VwuFCR_qWh4oPi",
                "alt": "Video flappyBird"
            },
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/Flappy-Bird/flappyBird.gif",
                "alt": "flappyBird"
            },
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/Flappy-Bird/mainMenu.png",
                "alt": "flappyBird"
            },
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/Flappy-Bird/inGame.png",
                "alt": "flappyBird"
            },
            {
                "type": "image",
                "src": "/images/projects/independent-ventures/Flappy-Bird/gameOver.png",
                "alt": "flappyBird"
            }
        ],
        "description": {
            "English": "Flappy-Bird is a game developd in Unity 6 using C#. The game is a clone of the original Flappy Bird game. The game has a start screen, a game screen, and a game over screen. you can play the game using tap if you are in a mobile device or using space if you are in a computer. The game has a score system that increases the score when the player passes through the pipes.",
            "Español": "Flappy-Bird es un juego desarrollado en Unity 6 utilizando C#. El juego es un clon del juego original Flappy Bird. El juego tiene una pantalla de inicio, una pantalla de juego y una pantalla de game over. Puedes jugar el juego usando tap si estás en un dispositivo móvil o usando espacio si estás en una computadora. El juego tiene un sistema de puntuación que aumenta la puntuación cuando el jugador pasa a través de las tuberías."
        },
        "summary": {
            "English": "Flappy-Bird, developed in Unity 6 using C#, is a clone of the original Flappy Bird game. It features a start screen, game screen, and game over screen, with controls for mobile (tap) and computer (space). The game includes a scoring system that increases when the player passes through pipes.",
            "Español": "Flappy-Bird, desarrollado en Unity 6 con C#, es un clon del juego original Flappy Bird. Cuenta con una pantalla de inicio, pantalla de juego y pantalla de fin de juego, con controles para móviles (tocar) y computadora (barra espaciadora). El juego incluye un sistema de puntuación que aumenta cuando el jugador pasa a través de los tubos."
        },
        "links":[
            {
                "type": "github",
                "src": "https://github.com/batiacosta/Flappy-Bird",
                "platform": "Repository"
            },
            {
                "type": "web",
                "src": "https://play.unity.com/en/games/f782ca4c-16c4-40c6-953f-93b1ac041710/flappy-bird",
                "platform": "Playable Demo (mobile and desktop)"
            }
        ],
        "tags": {
            "English": ["Unity 6", "C#", "Game Development", "Public Repository"],
            "Español": ["Unity 6", "C#", "Desarrollo de Juegos", "Repositorio Público"]
        }
    }
]
