[
    {
        "title": {
            "English": "Zeitreise Niederburg",
            "Español": "Zeitreise Niederburg"
        },
        "media": [
            {
                "type": "youtube",
                "src": "https://www.youtube.com/embed/aCjdCvAwrUc?si=M39AIxzYCR_-uTob",
                "alt": "Project"
            },
            {
                "type": "image",
                "src": "/images/projects/mandarscheid/mandarscheid-1.png",
                "alt": "mandarscheid"
            },
            {
                "type": "image",
                "src": "/images/projects/mandarscheid/mandarscheid-2.png",
                "alt": "mandarscheid"
            }
        ],
        "description": {
            "English": "Zeitreise Niederburg is an AR experience that takes you back in time to the medieval village of Manderscheid. The project was developed in collaboration with the Manderscheid Castle and the local community. \n\nAs part of ZAUBAR team, I was responsible for developing and maintaining the AR Application, creating mini-games, adding new features, and fixing bugs. The project was developed using Unity Engine, AR Foundation, C#, among other technologies.",
            "Español": "Zeitreise Niederburg es una experiencia de AR que te lleva de vuelta en el tiempo al pueblo medieval de Manderscheid. El proyecto fue desarrollado en colaboración con el Castillo de Manderscheid y la comunidad local. \n\nComo parte del equipo ZAUBAR, fui responsable de desarrollar y mantener la aplicación de AR, crear mini-juegos, agregar nuevas características y corregir errores. El proyecto fue desarrollado utilizando Unity Engine, AR Foundation, C#, entre otras tecnologías."
        },
        "summary": {
            "English": "Zeitreise Niederburg is an AR experience that transports users to medieval Manderscheid. Developed with Manderscheid Castle, I contributed to the AR app's development, mini-games, features, and bug fixes using Unity, AR Foundation, and C#.",
            "Español": "Zeitreise Niederburg es una experiencia de AR que transporta a los usuarios a la Manderscheid medieval. Desarrollado con el Castillo de Manderscheid, contribuí al desarrollo de la app de AR, mini-juegos, características y corrección de errores usando Unity, AR Foundation y C#."
        },
        "links":[
            {
                "type": "other",
                "src": "https://about.zaubar.com/en/solutions/tourism",
                "platform": "Project website"
            },
            {
                "type": "android",
                "src": "https://play.google.com/store/apps/details?id=com.zaubar.mandarscheid&hl=de",
                "platform": "Android"
            },
            {
                "type": "apple",
                "src": "https://apps.apple.com/de/app/zeitreise-niederburg/id6443941752?platform=iphone",
                "platform": "iOS"
            }
        ],
        "tags": {
            "English": ["Published", "AR", "Unity", "C#", "AR Foundation", "Contribution"],
            "Español": ["Publicado", "AR", "Unity", "C#", "AR Foundation", "Contribución"]
        }
    },
    {
        "title": {
            "English": "FreiBuddy",
            "Español": "FreiBuddy"
        },
        "media": [
            {
                "type": "image",
                "src": "/images/projects/freibuddy/freibuddy-1.png",
                "alt": "Freibuddy"
            },
            {
                "type": "image",
                "src": "/images/projects/freibuddy/freibuddy-2.png",
                "alt": "Freibuddy"
            },
            {
                "type": "image",
                "src": "/images/projects/freibuddy/freibuddy-3.png",
                "alt": "Freibuddy"
            }
        ],
        "description": {
            "English": "As part of the development team at ZAUBAR for the \"FreiBuddy\" app, I played a key role in enhancing the user experience by implementing accessibility features, while also making game adjustments, fixing bugs, and adding media and behaviors. \n\nThis AR-Serious Game, developed in collaboration with the Documentation Centre for National Socialism (DZNS) of the Freiburg Municipal Museums, offers three interactive augmented reality (AR) routes that provide insights into the past and present of Jewish life in Freiburg. My contributions ensured that the app was accessible and user friendly.\n\nThe \"FreiBuddy\" app invites players to explore the city of Freiburg through the eyes of fictitious guests, engaging in dialogues and small tasks to learn about Jewish life in a playful and educational manner. The app, which can be used on-site in Freiburg city centre, is designed to be used in groups, fostering discussion and deeper understanding. This participatory project, funded by the Foundation \"Remembrance, Responsibility, Future\" and the Baden-Württemberg State Centre for Political Education, showcases my ability to deliver high-quality, impactful AR experiences.",
            "Español": "Como parte del equipo de desarrollo en ZAUBAR para la aplicación \"FreiBuddy\", desempeñé un papel clave en la mejora de la experiencia del usuario mediante la implementación de funciones de accesibilidad, al tiempo que realizaba ajustes en el juego, corregía errores y añadía medios y comportamientos. \n\nEste AR-Serious Game, desarrollado en colaboración con el Centro de Documentación del Nacionalsocialismo (DZNS) de los Museos Municipales de Friburgo, ofrece tres rutas interactivas de realidad aumentada (AR) que proporcionan información sobre el pasado y el presente de la vida judía en Friburgo. Mis contribuciones aseguraron que la aplicación fuera accesible y fácil de usar.\n\nLa aplicación \"FreiBuddy\" invita a los jugadores a explorar la ciudad de Friburgo a través de los ojos de huéspedes ficticios, participando en diálogos y pequeñas tareas para aprender sobre la vida judía de una manera lúdica y educativa. La aplicación, que se puede utilizar en el centro de la ciudad de Friburgo, está diseñada para ser utilizada en grupos, fomentando la discusión y el entendimiento más profundo. Este proyecto participativo, financiado por la Fundación \"Recuerdo, Responsabilidad, Futuro\" y el Centro Estatal de Educación Política de Baden-Wurtemberg, muestra mi capacidad para ofrecer experiencias de AR de alta calidad e impacto."
        },
        "summary": {
            "English": "I enhanced the \"FreiBuddy\" AR app by implementing accessibility features, game adjustments, bug fixes, and adding media. The app educates users about Jewish life in Freiburg through interactive AR routes.",
            "Español": "Mejoré la aplicación AR \"FreiBuddy\" mediante la implementación de funciones de accesibilidad, ajustes en el juego, corrección de errores y añadiendo medios. La aplicación educa a los usuarios sobre la vida judía en Friburgo a través de rutas AR interactivas."
        },
        "links":[
            {
                "type": "android",
                "src": "https://play.google.com/store/apps/details?id=com.zaubar.freiburg&hl=en",
                "platform": "Android"
            },
            {
                "type": "apple",
                "src": "https://apps.apple.com/de/app/freibuddy/id6447895903",
                "platform": "iOS"
            }
        ],
        "tags": {
            "English": ["Published", "AR", "Unity", "C#", "AR Foundation", "Contribution"],
            "Español": ["Publicado", "AR", "Unity", "C#", "AR Foundation", "Contribución"]
        }
    },
    {
        "title": {
            "English": "Book Tower 75",
            "Español": "Torre del libro 75"
        },
        "media": [
            {
                "type": "youtube",
                "src": "https://www.youtube.com/embed/sbdUhaolV54?si=IXhpywo0OpslHvev",
                "alt": "BookTower"
            },
            {
                "type": "image",
                "src": "/images/projects/booktower/booktower.webp",
                "alt": "BookTower"
            }
        ],
        "description": {
            "English": "In 2023, I collaborated on an innovative AR project for the Frankfurt Book Fair's 75th anniversary. I animated the 3D tower and programmed a Unity shader to integrate building meshes from Google Maps, ensuring the AR book tower blended seamlessly with the cityscape of Frankfurt. This project, a gift from ZAUBAR, transformed the Messeturm into a giant stack of books using AI-based AR technology, allowing visitors to capture and share unique photos.\n\nThe \"Book Tower\" campaign, accessible via www.booktower75.com, was a highlight of the fair, promoting the relevance of books and reading in the age of AI. Visitors could engage with the AR experience on-site and share their photos with the hashtag #booktower75 for a chance to win new releases. This project showcased my skills in AR development and my ability to create immersive, interactive experiences.",
            "Español": "En 2023, colaboré en un innovador proyecto de AR para el 75 aniversario de la Feria del Libro de Frankfurt. Animé la torre 3D y programé un shader de Unity para integrar mallas de edificios de Google Maps, asegurando que la torre de libros AR se mezclara perfectamente con el paisaje urbano de Frankfurt. Este proyecto, un regalo de ZAUBAR, transformó el Messeturm en una pila gigante de libros utilizando tecnología AR basada en IA, permitiendo a los visitantes capturar y compartir fotos únicas.\n\nLa campaña \"Book Tower\", accesible a través de www.booktower75.com, fue uno de los puntos destacados de la feria, promoviendo la relevancia de los libros y la lectura en la era de la IA. Los visitantes pudieron interactuar con la experiencia de AR en el lugar y compartir sus fotos con el hashtag #booktower75 para tener la oportunidad de ganar nuevos lanzamientos. Este proyecto mostró mis habilidades en el desarrollo de AR y mi capacidad para crear experiencias inmersivas e interactivas."
        },
        "summary": {
            "English": "I animated a 3D tower and programmed the occlusion for an AR project at the 2023 Frankfurt Book Fair, blending it with Frankfurt's cityscape. The \"Book Tower\" campaign promoted reading and showcased my AR skills.",
            "Español": "Animé una torre 3D y programé la oclusión para un proyecto de AR en la Feria del Libro de Frankfurt 2023, mezclándola con el paisaje urbano de Frankfurt. La campaña \"Book Tower\" promovió la lectura y mostró mis habilidades en AR."
        },
        "links":[
            {
                "type": "other",
                "src": "https://about.zaubar.com/en/blog/worlds-largest-ar-book-tower-during-frankfurt-book-fair",
                "platform": "Website article"
            }
        ],
        "tags": {
            "English": ["Published", "AR", "Unity", "C#", "AR Foundation", "Contribution"],
            "Español": ["Publicado", "AR", "Unity", "C#", "AR Foundation", "Contribución"]
        }
    },
    {
        "title": {
            "English": "Stolpersteine NRW",
            "Español": "Stolpersteine NRW"
        },
        "media": [
            {
                "type": "youtube",
                "src": "https://www.youtube.com/embed/tIcCy-fLRZ0?si=BrXgsrUeh5pf9n3b",
                "alt": "Stolpersteine NRW"
            },
            {
                "type": "youtube",
                "src": "https://www.youtube.com/embed/BJ8o-dPw5EY?si=r3rblET2jsYTHfj8",
                "alt": "Stolpersteine NRW"
            },
            {
                "type": "image",
                "src": "/images/projects/stolpersteine/stolpersteine-1.png",
                "alt": "BookTower"
            },
            {
                "type": "image",
                "src": "/images/projects/stolpersteine/stolpersteine-2.png",
                "alt": "BookTower"
            }
        ],
        "description": {
            "English": "As part of the talented team at ZAUBAR, I contributed to the development of the Augmented Reality (AR) features for the Stolpersteine NRW app. This app serves as an interactive memorial to the victims of National Socialism, bringing history to life through texts, photos, audio stories, graphic stories, and AR elements. My primary responsibilities included implementing accessibility features such as screen-reading and font adjustments based on device settings. To achieve this, I developed native libraries in Java and Swift. Additionally, I played a key role in the implementation of the new user interface for the AR side of the app, enhancing user experience and engagement. I also focused on fixing bugs related to plane detection and AR placement, ensuring a smooth and accurate AR experience.\n\nThe Stolpersteine NRW app provides detailed information about individuals who lived in various streets and cities during the NS era. It offers an immersive way to explore the stories of the victims through Augmented Reality features. The app utilizes Google Maps for navigation to Stolpersteine locations and  AR functionalities. It contains information on approximately 17,000 Stolpersteine in over 280 cities in North Rhine-Westphalia (NRW), each commemorating a victim of National Socialism. The project was supported by experts from over 250 cities in NRW, whose knowledge and research were invaluable.",
            "Español": "Como parte del talentoso equipo de ZAUBAR, contribuí al desarrollo de las funciones de Realidad Aumentada (AR) para la aplicación Stolpersteine NRW. Esta aplicación sirve como un memorial interactivo a las víctimas del Nacionalsocialismo, dando vida a la historia a través de textos, fotos, historias de audio, historias gráficas y elementos de AR. Mis responsabilidades principales incluyeron la implementación de funciones de accesibilidad como la lectura de pantalla y ajustes de fuente basados en la configuración del dispositivo. Para lograr esto, desarrollé bibliotecas nativas en Java y Swift. Además, desempeñé un papel clave en la implementación de la nueva interfaz de usuario para el lado de AR de la aplicación, mejorando la experiencia del usuario y la participación. También me enfoqué en corregir errores relacionados con la detección de planos y la colocación de AR, asegurando una experiencia de AR fluida y precisa.\n\nLa aplicación Stolpersteine NRW proporciona información detallada sobre individuos que vivieron en varias calles y ciudades durante la era del NS. Ofrece una forma inmersiva de explorar las historias de las víctimas a través de funciones de Realidad Aumentada. La aplicación utiliza Google Maps para la navegación a las ubicaciones de Stolpersteine y funcionalidades de AR. Contiene información sobre aproximadamente 17,000 Stolpersteine en más de 280 ciudades en Renania del Norte-Westfalia (NRW), cada uno conmemorando a una víctima del Nacionalsocialismo. El proyecto fue apoyado por expertos de más de 250 ciudades en NRW, cuyo conocimiento e investigación fueron invaluables."
        },
        "summary": {
            "English": "Developed AR features for Stolpersteine NRW app at ZAUBAR, focusing on accessibility, UI, and bug fixes. The app memorializes NS victims with AR, texts, and media, covering 17,000 Stolpersteine in NRW.",
            "Español": "Desarrollé funciones de AR para la aplicación Stolpersteine NRW en ZAUBAR, centrándome en accesibilidad, UI y corrección de errores. La aplicación conmemora a las víctimas del NS con AR, textos y medios, cubriendo 17,000 Stolpersteine en NRW."
        },
        "links":[
            {
                "type": "apple",
                "src": "https://apps.apple.com/es/app/stolpersteine-nrw/id1582598963",
                "platform": "iOS"
            },
            {
                "type": "android",
                "src": "https://play.google.com/store/apps/details?id=de.WDR.Stolpersteine_NRW&hl=en",
                "platform": "Android"
            }
        ],
        "tags": {
            "English": ["Published", "AR", "Unity", "C#", "AR Foundation", "Contribution"],
            "Español": ["Publicado", "AR", "Unity", "C#", "AR Foundation", "Contribución"]
        }
    },
    {
        "title": {
            "English": "Rekovelle Mixed Reality LAPD",
            "Español": "Rekovelle Mixed Reality LAPD"
        },
        "media": [
            {
                "type": "youtube",
                "src": "https://www.youtube.com/embed/eVhM-bYYBpw?si=T1SCTOqoxm-B8IR6",
                "alt": "Rekovelle Pen AR"
            },
            {
                "type": "image",
                "src": "/images/projects/rekovelle/rekovelle-1.jpeg",
                "alt": "BookTower"
            },
            {
                "type": "image",
                "src": "/images/projects/rekovelle/rekovelle-2.jpeg",
                "alt": "BookTower"
            }
        ],
        "description": {
            "English": "I developed the Rekovelle Pen AR app, initially designed for Hololens 1 and later migrated and enhanced for iPadOS. As the sole developer on this project, I was responsible for programming, animating, and implementing the interactivity of the application. I also created 3D models for most of the visual elements and integrated audio sequences according to the storyboard. The app was built using Unity, AR Foundation, and C#.\n\nRekovelle Pen AR is an Augmented Reality app primarily designed for iPad. It utilizes the iPad camera to reference the real world and place interactive 3D models within it. Users can view and interact with these models through the iPad screen. The app presents content related to the Rekovelle Pen in an engaging manner, using animations, 3D models, and sound. Currently, the app is available in a few countries, offering an immersive and informative experience.",
            "Español": "Desarrollé la aplicación Rekovelle Pen AR, inicialmente diseñada para Hololens 1 y posteriormente migrada y mejorada para iPadOS. Como único desarrollador en este proyecto, fui responsable de programar, animar e implementar la interactividad de la aplicación. También creé modelos 3D para la mayoría de los elementos visuales e integré secuencias de audio según el guion. La aplicación se construyó utilizando Unity, AR Foundation y C#.\n\nRekovelle Pen AR es una aplicación de Realidad Aumentada diseñada principalmente para iPad. Utiliza la cámara del iPad para hacer referencia al mundo real y colocar modelos 3D interactivos dentro de él. Los usuarios pueden ver e interactuar con estos modelos a través de la pantalla del iPad. La aplicación presenta contenido relacionado con el Rekovelle Pen de una manera atractiva, utilizando animaciones, modelos 3D y sonido. Actualmente, la aplicación está disponible en pocos países, ofreciendo una experiencia inmersiva e informativa."
        },
        "summary": {
            "English": "Developed Rekovelle Pen AR app for iPadOS, handling programming, animation, and 3D modeling. The app uses AR to display interactive 3D models and content related to Rekovelle Pen. Built with Unity and C#.",
            "Español": "Desarrollé la aplicación Rekovelle Pen AR para iPadOS, manejando programación, animación y modelado 3D. La aplicación utiliza AR para mostrar modelos 3D interactivos y contenido relacionado con Rekovelle Pen. Construido con Unity y C#."
        },
        "links":[
            {
                "type": "other",
                "src": "https://appadvice.com/app/rekovelle-mixed-reality-lapd/1537947706",
                "platform": "Website article"
            },
            {
                "type": "apple",
                "src": "https://apps.apple.com/us/app/id1537947706",
                "platform": "iPad only for few countries"
            }
        ],
        "tags": {
            "English": ["Published", "AR", "Unity", "C#", "AR Foundation", "Contribution"],
            "Español": ["Publicado", "AR", "Unity", "C#", "AR Foundation", "Contribución"]
        }
    },
    {
        "title": {
            "English": "VR hyaluronic acid game",
            "Español": "Juego de ácido hialurónico VR"
        },
        "media": [
            {
                "type": "youtube",
                "src": "https://www.youtube.com/embed/S2r8IC5hlmo?si=7q6u9gWWyPf8RdB3",
                "alt": "Rekovelle Pen AR"
            },
            {
                "type": "image",
                "src": "/images/projects/Hyamovis/hyamovis-1.gif",
                "alt": "BookTower"
            }
        ],
        "description": {
            "English": "I developed a VR game to promote Hymovis IADD4, a hyaluronic acid solution for knee treatment. In this game, players interact with a damaged knee, collecting hyaluronic acid molecules to heal it. As molecules are added, the knee gradually recovers, culminating in a syringe injecting the acid once the goal of 4 mg is reached. I was responsible for rigging and animating the model, as well as modeling the hyaluronic molecules. The game, built using Unity and C#, allows players to grab, throw, or gently place the molecules. It was showcased at an osteo field convention in Santa Marta City.",
            "Español": "Desarrollé un juego de VR para promocionar Hymovis IADD4, una solución de ácido hialurónico para el tratamiento de rodilla. En este juego, los jugadores interactúan con una rodilla dañada, recolectando moléculas de ácido hialurónico para sanarla. A medida que se añaden moléculas, la rodilla se recupera gradualmente, culminando en una jeringa que inyect"
        },
        "summary": {
            "English": "Developed a VR game for Hymovis IADD4, where players collect hyaluronic acid molecules to heal a damaged knee. Built with Unity and C#, showcased at an osteo field convention in Santa Marta City.",
            "Español": "Desarrollé un juego de VR para Hymovis IADD4, donde los jugadores recolectan moléculas de ácido hialurónico para sanar una rodilla dañada. Construido con Unity y C#, mostrado en una convención de campo osteo en la ciudad de Santa Marta."
        },
        "links":[
            {
                "type": "github",
                "src": "https://github.com/batiacosta/EncontrarMayoURP/releases/tag/V1",
                "platform": "Meta Quest APK"
            }
        ],
        "tags": {
            "English": ["Shipped", "VR", "Unity", "C#", "XR Toolkit", "Contribution", "Meta Quest 2"],
            "Español": ["Publicado", "VR", "Unity", "C#", "XR Toolkit", "Contribución", "Meta Quest 2"]
        }
    },
    {
        "title": {
            "English": "Porfiria App (Mobile App)",
            "Español": "Porfiria App (App Móvil)"
        },
        "media": [
            {
                "type": "image",
                "src": "/images/projects/porfiria/porfiria-1.webp",
                "alt": "Porfiria"
            },
            {
                "type": "image",
                "src": "/images/projects/porfiria/porfiria-2.webp",
                "alt": "Porfiria"
            },
            {
                "type": "image",
                "src": "/images/projects/porfiria/porfiria-3.webp",
                "alt": "Porfiria"
            },
            {
                "type": "image",
                "src": "/images/projects/porfiria/porfiria-4.webp",
                "alt": "Porfiria"
            }
        ],
        "description": {
            "English": "I developed a mobile application called Porfiria App using Flutter and Firebase, aimed at assisting doctors in emergency and frontline settings to identify the symptoms of Porphyria, a rare disease. I was responsible for the complete programming of the application, integrating content, and designing the graphical interface according to the UI designs provided by the designer. The application is available for both iOS and Android devices, including phones and tablets.\n\nThe application was published on the AppStore and PlayStore under the name GRAZILES, the advertising agency I worked for at the time. This project allowed me to apply my technical skills in Flutter and Firebase, as well as collaborate closely with designers and other professionals to create a useful and accessible tool for medical personnel. The experience of taking this application from conception to launch provided me with valuable lessons in software development and project management.",
            "Español": "Desarrollé una aplicación móvil llamada Porfiria App utilizando Flutter y Firebase, con el objetivo de ayudar a los médicos en situaciones de emergencia y de primera línea a identificar los síntomas de la Porfiria, una enfermedad rara. Fui responsable de la programación completa de la aplicación, integrando contenido y diseñando la interfaz gráfica de acuerdo con los diseños de UI proporcionados por el diseñador. La aplicación está disponible para dispositivos iOS y Android, incluyendo teléfonos y tabletas.\n\nLa aplicación fue publicada en el AppStore y PlayStore bajo el nombre GRAZILES, la agencia de publicidad para la que trabajaba en ese momento. Este proyecto me permitió aplicar mis habilidades técnicas en Flutter y Firebase, así como colaborar estrechamente con diseñadores y otros profesionales para crear una herramienta útil y accesible para el personal médico. La experiencia de llevar esta aplicación desde la concepción hasta el lanzamiento me proporcionó valiosas lecciones en desarrollo de software y gestión de proyectos."
        },
        "summary": {
            "English": "I developed Porfiria App using Flutter and Firebase to help doctors identify Porphyria symptoms. Published by GRAZILES, it’s available on iOS and Android. This project enhanced my skills in software development and project management.",
            "Español": "Desarrollé Porfiria App utilizando Flutter y Firebase para ayudar a los médicos a identificar los síntomas de Porfiria. Publicada por GRAZILES, está disponible en iOS y Android. Este proyecto mejoró mis habilidades en desarrollo de software y gestión de proyectos."
        },
        "links":[
            {
                "type": "apple",
                "src": "https://apps.apple.com/co/app/porfiria-app/id6479202660?platform=iphone",
                "platform": "iOS, iPadOS"
            }
        ],
        "tags": {
            "English": ["Shipped", "Mobile App", "Flutter","Contribution", "iOS"],
            "Español": ["Publicado", "Aplicación Móvil", "Flutter", "Contribución", "iOS"]
        }
    },
    {
        "title": {
            "English": "PROA UNAL (Mobile App)",
            "Español": "PROA UNAL (App Móvil)"
        },
        "media": [
            {
                "type": "image",
                "src": "/images/projects/proa-unal/proa-unal-1.webp",
                "alt": "proa-unal"
            },
            {
                "type": "image",
                "src": "/images/projects/proa-unal/proa-unal-2.webp",
                "alt": "proa-unal"
            },
            {
                "type": "image",
                "src": "/images/projects/proa-unal/proa-unal-3.webp",
                "alt": "proa-unal"
            }
        ],
        "description": {
            "English": "I developed the PROA UNAL application for the Universidad Nacional de Colombia, aimed at providing a tool for medical professionals in frontline and emergency settings to identify and suggest appropriate antimicrobials for various scenarios, such as \"Acquired pneumonia in the community,\" \"skin infections,\" \"urinary tract infections,\" and other cases. The application was built using Flutter and Firebase, ensuring robust authentication and database management.\n\nThis project allowed me to leverage my technical expertise in Flutter and Firebase while collaborating with medical experts to create a practical and reliable tool for healthcare providers. The application is available on both iOS and Android platforms, demonstrating my ability to deliver cross-platform solutions that meet the needs of diverse user groups. The experience of developing PROA UNAL has enriched my skills in software development and reinforced the importance of interdisciplinary collaboration.",
            "Español": "Desarrollé la aplicación PROA UNAL para la Universidad Nacional de Colombia, con el objetivo de proporcionar una herramienta para profesionales médicos en situaciones de primera línea y emergencia para identificar y sugerir antimicrobianos apropiados para varios escenarios, como \"Neumonía adquirida en la comunidad,\" \"infecciones de la piel,\" \"infecciones del tracto urinario,\" y otros casos. La aplicación se construyó utilizando Flutter y Firebase, asegurando una autenticación robusta y una gestión de base de datos.\n\nEste proyecto me permitió aprovechar mi experiencia técnica en Flutter y Firebase mientras colaboraba con expertos médicos para crear una herramienta práctica y confiable para los proveedores de atención médica. La aplicación está disponible en las plataformas iOS y Android, demostrando mi capacidad para ofrecer soluciones multiplataforma que satisfacen las necesidades de diversos grupos de usuarios. La experiencia de desarrollar PROA UNAL ha enriquecido mis habilidades en desarrollo de software y ha reforzado la importancia de la colaboración interdisciplinaria."
        },
        "summary": {
            "English": "I developed PROA UNAL for the Universidad Nacional de Colombia using Flutter and Firebase. It helps medical professionals identify and suggest antimicrobials for various infections. Available on iOS and Android, it showcases my cross-platform development skills.",
            "Español": "Desarrollé PROA UNAL para la Universidad Nacional de Colombia utilizando Flutter y Firebase. Ayuda a los profesionales médicos a identificar y sugerir antimicrobianos para diversas infecciones. Disponible en iOS y Android, muestra mis habilidades de desarrollo multiplataforma."
        },
        "links":[
            {
                "type": "apple",
                "src": "https://apps.apple.com/co/app/proa-unal/id1587700097?platform=iphone",
                "platform": "iOS, iPadOS"
            },
            {
                "type": "android",
                "src": "https://play.google.com/store/apps/details?id=co.edu.unal.proaunal&hl=es",
                "platform": "Android"
            }
        ],
        "tags": {
            "English": ["Shipped", "Mobile App", "Flutter","Contribution", "iOS", "Android"],
            "Español": ["Publicado", "Aplicación Móvil", "Flutter", "Contribución", "iOS", "Android"]
        }
    },
    {
        "title": {
            "English": "Cistinosis (Mobile App)",
            "Español": "Cistinosis (App Móvil)"
        },
        "media": [
            {
                "type": "image",
                "src": "/images/projects/cistinosis/cistinosis-1.webp",
                "alt": "cistinosis"
            },
            {
                "type": "image",
                "src": "/images/projects/cistinosis/cistinosis-2.webp",
                "alt": "cistinosis"
            },
            {
                "type": "image",
                "src": "/images/projects/cistinosis/cistinosis-3.webp",
                "alt": "cistinosis"
            }
        ],
        "description": {
            "English": "I developed the Cistinosis App using Flutter and Firebase, aimed at assisting pediatric medicine professionals in detecting the symptoms of Cystinosis, a rare genetic disease. Cystinosis causes the accumulation of cystine crystals in cells, leading to damage in various organs, particularly the kidneys and eyes12. The application provides a valuable tool for early diagnosis and management of this condition, ensuring that healthcare providers can offer timely and effective treatment.\n\nThis project was developed for Recordati while I was working at GRAZILES. It allowed me to utilize my technical skills in Flutter and Firebase to create a reliable and user-friendly application. Available on both iOS and Android platforms, the Cistinosis App showcases my ability to deliver cross-platform solutions that meet the specific needs of medical professionals. The experience of developing this app has further enhanced my expertise in software development and my understanding of the importance of creating tools that support healthcare providers in their critical work.",
            "Español": "Desarrollé la aplicación Cistinosis utilizando Flutter y Firebase, con el objetivo de ayudar a los profesionales de la medicina pediátrica a detectar los síntomas de la Cistinosis, una enfermedad genética rara. La Cistinosis causa la acumulación de cristales de cistina en las células, lo que conduce a daños en varios órganos, especialmente los riñones y los ojos12. La aplicación proporciona una herramienta valiosa para el diagnóstico temprano y el manejo de esta condición, asegurando que los proveedores de atención médica puedan ofrecer un tratamiento oportuno y efectivo.\n\nEste proyecto fue desarrollado para Recordati mientras trabajaba en GRAZILES. Me permitió utilizar mis habilidades técnicas en Flutter y Firebase para crear una aplicación confiable y fácil de usar. Disponible en las plataformas iOS y Android, la aplicación Cistinosis muestra mi capacidad para ofrecer soluciones multiplataforma que satisfacen las necesidades específicas de los profesionales médicos. La experiencia de desarrollar esta aplicación ha mejorado aún más mi experiencia en desarrollo de software y mi comprensión de la importancia de crear herramientas que apoyen a los proveedores de atención médica en su trabajo crítico."
        },
        "summary": {
            "English": "I developed Cistinosis App for Recordati using Flutter and Firebase to help pediatric professionals detect Cystinosis symptoms. Available on iOS and Android, it supports early diagnosis and treatment, showcasing my cross-platform development skills.",
            "Español": "Desarrollé la aplicación Cistinosis para Recordati utilizando Flutter y Firebase para ayudar a los profesionales pediátricos a detectar los síntomas de la Cistinosis. Disponible en iOS y Android, apoya el diagnóstico y tratamiento tempranos, mostrando mis habilidades de desarrollo multiplataforma."
        },
        "links":[
            {
                "type": "apple",
                "src": "https://apps.apple.com/co/app/cistinosis/id1664453687?platform=iphone",
                "platform": "iOS, iPadOS"
            }
        ],
        "tags": {
            "English": ["Shipped", "Mobile App", "Flutter","Contribution", "iOS"],
            "Español": ["Publicado", "Aplicación Móvil", "Flutter", "Contribución", "iOS"]
        }
    }
]
